## Neste projeto iremos trabalhar a criação de estrutura de dados utilizando as Series e DataFrames

In [50]:
import pandas as pd

## Series

#Aqui criaremos uma lista simples que contém uma sequência numérica de 1 à 5.

In [3]:
data=[1, 2, 3, 4, 5]

In [7]:
s=pd.Series(data)

In [5]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
index=["Linha" + str(i) for i in range(5)]

In [10]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [11]:
s = pd.Series(data=data, index=index)

In [12]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [17]:
data={'Linha' + str(i):i+1 for i in range (5)}

In [18]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [19]:
s=pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [20]:
s1=s+2

In [21]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [22]:
s2=s+s1

In [23]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

## DataFrame

#Aqui faremos uma nova lista numérica, na verdade, uma lista que contém outras listas.

In [24]:
data=[[1,2,3],[4,5,6],[7,8,9]]

In [25]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [26]:
df1=pd.DataFrame(data=data)

In [27]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [28]:
lista1=pd.DataFrame(data=data)

In [29]:
lista1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [30]:
df1=pd.DataFrame(data=data)

In [31]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [33]:
index=['Coluna'+str(i) for i in range(3)]
index

['Coluna0', 'Coluna1', 'Coluna2']

In [34]:
index=['Linha'+str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [35]:
df1=pd.DataFrame(data=data, index=index)
index

['Linha0', 'Linha1', 'Linha2']

In [36]:
df1=pd.DataFrame(data=data, index=index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [37]:
columns=['Coluna'+str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [38]:
df1=pd.DataFrame(data=data, index=index, columns=columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [39]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [41]:
df2=pd.DataFrame(data=data, index=index, columns=columns)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [42]:
data=[(1,2,3),(4,5,6),(7,8,9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [43]:
df3=pd.DataFrame(data=data, index=index, columns=columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [45]:
df1[df1>0]='A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [46]:
df2[df2>0]='B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [47]:
df3[df3>0]='C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

## Concatenação

#Aqui iremos acionar a ferramenta concat() do Pandas, que como indica o nome, realiza concatenações

In [48]:
df4=pd.concat([df1,df2,df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

## Concatenação de tabelas por linhas

In [49]:
df4=pd.concat([df1,df2,df3], axis=1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C